logs/20240610-051159-dummy_file.00001574/iodepth=16/rw=write/fio.log
job: (g=0): rw=write, bs=(R) 512KiB-512KiB, (W) 512KiB-512KiB, (T) 512KiB-512KiB, ioengine=libaio, iodepth=16
fio-3.35
Starting 1 process

job: (groupid=0, jobs=1): err= 0: pid=90555: Mon Jun 10 05:20:43 2024
  write: IOPS=291, BW=146MiB/s (153MB/s)(10.0GiB/70303msec); 0 zone resets
    slat (usec): min=36, max=130126, avg=99.35, stdev=1352.50
    clat (msec): min=2, max=251, avg=54.82, stdev=33.24
     lat (msec): min=2, max=251, avg=54.92, stdev=33.29
    clat percentiles (msec):
     |  1.00th=[   10],  5.00th=[   16], 10.00th=[   23], 20.00th=[   31],
     | 30.00th=[   37], 40.00th=[   42], 50.00th=[   46], 60.00th=[   52],
     | 70.00th=[   62], 80.00th=[   74], 90.00th=[  100], 95.00th=[  128],
     | 99.00th=[  174], 99.50th=[  188], 99.90th=[  211], 99.95th=[  226],
     | 99.99th=[  236]
   bw (  KiB/s): min=108544, max=205824, per=100.00%, avg=149248.00, stdev=19414.71, samples=140
   iops        : min=  212, max=  402, avg=291.50, stdev=37.92, samples=140
  lat (msec)   : 4=0.04%, 10=1.34%, 20=6.44%, 50=49.84%, 100=32.47%
  lat (msec)   : 250=9.88%, 500=0.01%
  cpu          : usr=0.24%, sys=1.85%, ctx=4902, majf=0, minf=9
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=99.9%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,20480,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
  WRITE: bw=146MiB/s (153MB/s), 146MiB/s-146MiB/s (153MB/s-153MB/s), io=10.0GiB (10.7GB), run=70303-70303msec

Disk stats (read/write):
    md127: ios=0/20498, merge=0/0, ticks=0/1118489, in_queue=1118489, util=99.09%, aggrios=8501/19916, aggrmerge=159701/458470, aggrticks=84154/125425, aggrin_queue=214709, aggrutil=52.74%
  sdf: ios=7963/19333, merge=162290/460721, ticks=75717/120637, in_queue=200834, util=50.22%
  sdd: ios=8951/20515, merge=159330/456481, ticks=86005/119979, in_queue=210477, util=43.89%
  sdb: ios=8802/20617, merge=155408/458534, ticks=87980/131153, in_queue=224398, util=45.81%
  sdi: ios=7981/19228, merge=158322/461075, ticks=85629/131840, in_queue=224020, util=52.74%
  sdg: ios=8085/19322, merge=159556/457846, ticks=72747/118330, in_queue=195701, util=49.28%
  sde: ios=8990/20544, merge=159931/456015, ticks=80812/111494, in_queue=196645, util=44.21%
  sdc: ios=9210/20544, merge=158989/458790, ticks=95182/138017, in_queue=239243, util=47.66%
  sdh: ios=8031/19227, merge=163783/458303, ticks=89161/131952, in_queue=226355, util=52.56%